KEYWORD_INSTRUCT = "Проаналізуй текст і визнач ключові елементи."

TAGGING_INSTRUCT = """Використай наведені нижче інструкції для обробки тексту.

    1. Виправлення граматичних помилок:
       - Формат: `<g ed="edit" et="тип помилки">error</g>`
       - Опис тегів:
         - Tag: категорія помилки, наприклад, G/Case, G/Tense, F/Style тощо.
         - error: текст до виправлення.
         - edit: текст після виправлення.
       - Типи помилок:
         - Орфографічні помилки:
           - Spelling: орфографічні помилки.
           - Punctuation: пунктуаційні помилки.
         - Граматичні помилки:
           - G/Case: неправильне використання відмінка.
           - G/Gender: неправильне використання роду.
           - G/Number: неправильне використання числа.
           - G/Aspect: неправильне використання аспекта дієслова.
           - G/Tense: неправильне використання часу дієслова.
           - G/VerbVoice: неправильне використання форми дієслова.
           - G/PartVoice: неправильне використання форми дієприкметника.
           - G/VerbAForm: неправильне використання аналітичної форми дієслова.
           - G/Prep: неправильне використання прийменників.
           - G/Participle: неправильне використання дієприкметників.
           - G/UngrammaticalStructure: відхилення від синтаксичних норм.
           - G/Comparison: неправильне утворення ступенів порівняння.
           - G/Conjunction: неправильне використання сполучників.
           - G/Other: інші граматичні помилки.
         - Мовні помилки:
           - F/Style: стилістичні помилки.
           - F/Calque: калька.
           - F/Collocation: неприродні словосполучення.
           - F/PoorFlow: неприродний ритм речення.
           - F/Repetition: повторення слів.
           - F/Other: інші мовні помилки.

    2. Ідентифікація названих сутностей (NER):
       - Формат: `<n t="тип сутності">назва</n>`
       - Опис тегів:
         - NER: тип сутності, наприклад, PERS, LOC, DATE, ORG тощо.
         - назва: текст сутності.
       - Типи сутностей:
         - ART: твір мистецтва (книга, фільм).
         - DATE: дата (25 грудня 2023).
         - DOC: документ (паспорт, закон).
         - JOB: професія (лікар, інженер).
         - LOC: локація (Київ, Україна).
         - MISC: різне (інше, що не підпадає під інші категорії).
         - MON: грошова одиниця (гривня, долар).
         - ORG: організація (ООН, Google).
         - PCT: відсоток (50%).
         - PERIOD: період часу (1990-ті роки).
         - PERS: особа (Тарас Шевченко).
         - QUANT: кількість (5 тонн, 3 книги).
         - TIME: час (14:00).

    3. Визначення частин мови:
       - Формат: `<p t="частина мови">слово</p>`
       - Опис тегів:
         - POS: частина мови, наприклад, NOUN, VERB, ADJ, PREP тощо.
         - слово: текст, до якого застосовується тег.
       - Типи частин мови:
         - NOUN: іменник ("зображення").
         - VERB: дієслово ("робити").
         - NUMR: числівник ("один").
         - ADV: прислівник ("точно").
         - ADJ: прикметник ("веселий").
         - PREP: прийменник ("в").
         - CONJ: сполучник ("і").
         - PART: частка ("не").
         - PRON: займенник ("ти").
         - ADJP: дієприкметник ("кохана").
         - PUNCT: розділовий знак (".")."""
